# 판다스 특성
* 결측 데이터들을 쉽게 처리
* Dataframe 및 고차원 객체에서 열을 삽입 및 삭제 가능
* 객체를 라벨 집합에 명시적으로 정렬하거나, 사용자가 라벨을 무시하고 Series Dataframe 등의 계산에서 자동으로 데이터 조정 가능
* 데이터 세트에서 집계 및 변환을 위한 split, apply, combine 작업을 수행할 수 있는 group_by합수 제공
* 누락된 데이터 또는 다른 Python, Numpy 데이터 구조에서 서로 다른 인덱싱 데이터를 Dataframe개체로 쉽게 변환
* 대용량 데이터 세트의 지능형 라벨 기반 슬라이싱, 고급 인덱싱 및 부분 집합 구하기 가능
* 직관적인 데이터 세트 병합 및 결합
* 데이터 세트의 유연한 재구성 및 피벗
* 축의 꼐층적 라벨링
* 플랫 파일(CSV 및 구분), Excel 파일, 데이터 베이스 로딩 및초고속 HDF5형식의 데이터 저장/로드에 사용되는 강력한 IO도구
* 시계열 특정 기능: 날짜 범위 생성 및 주파수 변환, 무빙 윈도우(moving window)통계, 날짜 이동 및 지연

In [4]:
import numpy as np
import pandas as pd
pd.__version__

'1.1.3'

 # 판다스 객체
 ## Series 객체

In [37]:
s= pd.Series([0, 0.25,0.5,0.75,1.0])
s

0    0.00
1    0.25
2    0.50
3    0.75
4    1.00
dtype: float64

In [38]:
s.values

array([0.  , 0.25, 0.5 , 0.75, 1.  ])

In [39]:
s.index

RangeIndex(start=0, stop=5, step=1)

In [42]:
s[1]

0.25

In [41]:
s[1:4]

1    0.25
2    0.50
3    0.75
dtype: float64

In [34]:
s= pd.Series([0, 0.25,0.5,0.75,1.0],
            index=['a','b','c','d','e'])
s

a    0.00
b    0.25
c    0.50
d    0.75
e    1.00
dtype: float64

In [36]:
s['a']

0.0

In [ ]:
s[['a','b','c']]

In [ ]:
'b' in s

In [27]:
s= pd.Series([0, 0.25,0.5,0.75,1.0],
            index=['a','b','c','d','e'])
s

2     False
4      True
6     False
8      True
10    False
dtype: bool

In [56]:
pop_tuple= {'서울특별시': 9720846,
            '부산광역시': 3804423,
            '인천광역시': 2947217,
            '대구광역시': 2427954,
            '대전광역시': 1471040,
            '광주광역시': 1455048}
population=pd.Series(pop_tuple)
population

서울특별시    9720846
부산광역시    3804423
인천광역시    2947217
대구광역시    2427954
대전광역시    1471040
광주광역시    1455048
dtype: int64

In [46]:
population['서울특별시']

9720846

In [49]:
population['서울특별시':'인천광역시']
population[0:3]

서울특별시    9720846
부산광역시    3804423
인천광역시    2947217
dtype: int64

## DataFrame 객체
* pd.DataDrame{시리즈, 시리즈, ...}

In [53]:
pd.DataFrame([{'a':2,'b':4,'d':3},{'a':4,'b':5,'c':7}])

   a  b    d    c
0  2  4  3.0  NaN
1  4  5  NaN  7.0

In [55]:
pd.DataFrame(np.random.rand(5,5),
            columns=['a','b','c','d','e'],
            index=[1,2,3,4,5])

          a         b         c         d         e
1  0.467845  0.326307  0.077559  0.564413  0.822174
2  0.273076  0.042126  0.101116  0.181815  0.460698
3  0.701311  0.060490  0.246041  0.811878  0.724621
4  0.414291  0.083142  0.956892  0.544452  0.044622
5  0.601455  0.948671  0.820452  0.648893  0.555490

In [58]:
male_tuple= {'서울특별시': 4732275,
             '부산광역시': 1668618,
             '인천광역시': 1476813,
             '대구광역시': 1198815,
             '대전광역시': 734441,
             '광주광역시': 720060}
male=pd.Series(male_tuple)
male

서울특별시    4732275
부산광역시    1668618
인천광역시    1476813
대구광역시    1198815
대전광역시     734441
광주광역시     720060
dtype: int64

In [59]:
female_tuple= {'서울특별시': 4988571,
             '부산광역시': 1735805,
             '인천광역시': 1470404,
             '대구광역시': 1229139,
             '대전광역시': 736599,
             '광주광역시': 734988}
female=pd.Series(female_tuple)
female

서울특별시    4988571
부산광역시    1735805
인천광역시    1470404
대구광역시    1229139
대전광역시     736599
광주광역시     734988
dtype: int64

In [65]:
korea_df= pd.DataFrame({'인구수':population,
                       '남자인구수':male,
                       '여자인구수':female})
korea_df

           인구수    남자인구수    여자인구수
서울특별시  9720846  4732275  4988571
부산광역시  3804423  1668618  1735805
인천광역시  2947217  1476813  1470404
대구광역시  2427954  1198815  1229139
대전광역시  1471040   734441   736599
광주광역시  1455048   720060   734988

In [66]:
korea_df['여자인구수']

서울특별시    4988571
부산광역시    1735805
인천광역시    1470404
대구광역시    1229139
대전광역시     736599
광주광역시     734988
Name: 여자인구수, dtype: int64

In [73]:
korea_df[0:3]
korea_df['서울특별시':'인천광역시']

           인구수    남자인구수    여자인구수
서울특별시  9720846  4732275  4988571
부산광역시  3804423  1668618  1735805
인천광역시  2947217  1476813  1470404

## Index 객체
* index: 일반적인 Index객체,Numpy 배열 형식으로 축의 이름 표현
* Int54Index: 정수 값을 위한 Index
* MultiIndex: 단일 축에 여러 단계 색인을 표현하는 계승적 Index객체
* DatetimeIndex: Numpy의 datetime64 타입으로 타임스탬프 저장
* PeriodIndex: 기간 데이터를 위한 Index

In [75]:
idx = pd.Index([2,4,6,8,10])
idx

Int64Index([2, 4, 6, 8, 10], dtype='int64')

In [76]:
idx[1]

4

In [79]:
idx[1:2:2]

Int64Index([4], dtype='int64')

In [80]:
idx[-1::]

Int64Index([10], dtype='int64')

In [82]:
idx[::2]

Int64Index([2, 6, 10], dtype='int64')

In [84]:
print(idx)
print(idx.shape)
print(idx.ndim)
print(idx.dtype)

Int64Index([2, 4, 6, 8, 10], dtype='int64')
(5,)
1
int64

### Index 연산
* append: 색인 추가
* difference: 차집합
* intersectino: 교집합
* union: 합집합
* isin: 색인이 존재하는지 여부
* delete: 해당 색인 삭제
* drop: 해당 값을 삭제
* insert: 색인이 추가된 새로운 색인 반환
* is_monotonic: 색인이 단조성을 가지면 true
* is_unique: 중복되는 색인이 없으면 True
* unique: 중복되는 것을 제거하고 unique한 것만 반환

In [101]:
idx1=pd.Index([1,2,4,6,8])
idx2=pd.Index([2,4,5,6,7])
print(idx1.append(idx2))
print(idx1.difference(idx2))
print(idx1-idx2)
print(idx1.intersection(idx2))
print(idx1 & idx2)
print(idx1.union(idx2))
print(idx1|idx2)
print(idx1.delete(0))
print(idx1.drop(1))
print(idx1^idx2)

Int64Index([1, 2, 4, 6, 8, 2, 4, 5, 6, 7], dtype='int64')
Int64Index([1, 8], dtype='int64')
Int64Index([-1, -2, -1, 0, 1], dtype='int64')
Int64Index([2, 4, 6], dtype='int64')
Int64Index([2, 4, 6], dtype='int64')
Int64Index([1, 2, 4, 5, 6, 7, 8], dtype='int64')
Int64Index([1, 2, 4, 5, 6, 7, 8], dtype='int64')
Int64Index([2, 4, 6, 8], dtype='int64')
Int64Index([2, 4, 6, 8], dtype='int64')
Int64Index([1, 5, 7, 8], dtype='int64')

 # 인덱싱(indexing)

In [102]:
s= pd.Series([0, 0.25,0.5,0.75,1.0],
            index=['a','b','c','d','e'])
s

a    0.00
b    0.25
c    0.50
d    0.75
e    1.00
dtype: float64

In [103]:
s.keys()

Index(['a', 'b', 'c', 'd', 'e'], dtype='object')

In [105]:
list(s.items())

[('a', 0.0), ('b', 0.25), ('c', 0.5), ('d', 0.75), ('e', 1.0)]

In [106]:
s['f']=1.25

In [110]:
s[(s>0.4)&(s<0.8)]

c    0.50
d    0.75
dtype: float64

## Series 인덱싱

In [111]:
s=pd.Series(['a','b','c','d','e'],index=[1,3,5,7,9])
s

1    a
3    b
5    c
7    d
9    e
dtype: object

In [112]:
s[1]

'a'

In [113]:
s[2:4]

5    c
7    d
dtype: object

In [114]:
s.iloc[1] # iloc은 정수값을 그대로 반환

'b'

In [115]:
s.iloc[2:4]

5    c
7    d
dtype: object

In [119]:
s.reindex(range(10))

0    NaN
1      a
2    NaN
3      b
4    NaN
5      c
6    NaN
7      d
8    NaN
9      e
dtype: object

In [120]:
s.reindex(range(10),method='bfill')

0    a
1    a
2    b
3    b
4    c
5    c
6    d
7    d
8    e
9    e
dtype: object

## DataFrame인덱싱
 * df[val]: 칼럼선택
 * df.loc[val]: 라벨값으로 로우의 부분집합 선택
 * df.loc[:, val]: 라벨값으로 칼럼의 부분집합 선택
 * df.loc[val,val]: 라벨값으로 로우와 칼럼의 부분집합 선택
 * df.loc[val]: 라벨값으로 로우의 부분집합 선택
 * df.iloc[:where]: 정수색인으로 칼럼의 부분집합 선택
 * df.iloc[where,where]: 정수색인으로 로우와 칼럼의 부분집합 선택
 * df.iloc[where]: 정수색인으로 로우의 부분집합 선택
 * df.at[label_i,label_j]:라벨값으로 단일값 선택
 * df.i[i,j]:정수 색인으로 단일값 선택
 * reindex: 하나 이상의 축을 새로운 색인으로 재색인
 * get_value,set_value: 로우와 칼럼의 이름으로 값 선택

In [121]:
korea_df

           인구수    남자인구수    여자인구수
서울특별시  9720846  4732275  4988571
부산광역시  3804423  1668618  1735805
인천광역시  2947217  1476813  1470404
대구광역시  2427954  1198815  1229139
대전광역시  1471040   734441   736599
광주광역시  1455048   720060   734988

In [122]:
korea_df['남자인구수']

서울특별시    4732275
부산광역시    1668618
인천광역시    1476813
대구광역시    1198815
대전광역시     734441
광주광역시     720060
Name: 남자인구수, dtype: int64

In [123]:
korea_df.남자인구수

서울특별시    4732275
부산광역시    1668618
인천광역시    1476813
대구광역시    1198815
대전광역시     734441
광주광역시     720060
Name: 남자인구수, dtype: int64

In [128]:
korea_df['남여비율']=(korea_df['남자인구수']*100/korea_df['여자인구수'])
korea_df

           인구수    남자인구수    여자인구수        남여비율
서울특별시  9720846  4732275  4988571   94.862336
부산광역시  3804423  1668618  1735805   96.129346
인천광역시  2947217  1476813  1470404  100.435867
대구광역시  2427954  1198815  1229139   97.532907
대전광역시  1471040   734441   736599   99.707032
광주광역시  1455048   720060   734988   97.968946

In [129]:
korea_df.values

array([[9.72084600e+06, 4.73227500e+06, 4.98857100e+06, 9.48623363e+01],
       [3.80442300e+06, 1.66861800e+06, 1.73580500e+06, 9.61293463e+01],
       [2.94721700e+06, 1.47681300e+06, 1.47040400e+06, 1.00435867e+02],
       [2.42795400e+06, 1.19881500e+06, 1.22913900e+06, 9.75329072e+01],
       [1.47104000e+06, 7.34441000e+05, 7.36599000e+05, 9.97070319e+01],
       [1.45504800e+06, 7.20060000e+05, 7.34988000e+05, 9.79689464e+01]])

In [131]:
#행과 열 Transpose
korea_df.T

,서울특별시,부산광역시,인천광역시,대구광역시,대전광역시,광주광역시
인구수,9.720846e+06,3.804423e+06,2.947217e+06,2.427954e+06,1.471040e+06,1.455048e+06
남자인구수,4.732275e+06,1.668618e+06,1.476813e+06,1.198815e+06,7.344410e+05,7.200600e+05
여자인구수,4.988571e+06,1.735805e+06,1.470404e+06,1.229139e+06,7.365990e+05,7.349880e+05
남여비율,9.486234e+01,9.612935e+01,1.004359e+02,9.753291e+01,9.970703e+01,9.796895e+01

In [134]:
korea_df.values[0]

array([9.72084600e+06, 4.73227500e+06, 4.98857100e+06, 9.48623363e+01])

koread_df['인구수']

In [137]:
korea_df.loc[:"인천광역시",:"남자인구수"]

           인구수    남자인구수
서울특별시  9720846  4732275
부산광역시  3804423  1668618
인천광역시  2947217  1476813

In [141]:
korea_df.loc[(korea_df.여자인구수>1000000)]

           인구수    남자인구수    여자인구수        남여비율
서울특별시  9720846  4732275  4988571   94.862336
부산광역시  3804423  1668618  1735805   96.129346
인천광역시  2947217  1476813  1470404  100.435867
대구광역시  2427954  1198815  1229139   97.532907

In [143]:
korea_df.loc[(korea_df.인구수 > 2500000)]

           인구수    남자인구수    여자인구수        남여비율
서울특별시  9720846  4732275  4988571   94.862336
부산광역시  3804423  1668618  1735805   96.129346
인천광역시  2947217  1476813  1470404  100.435867

In [145]:
 korea_df.loc[(korea_df.남여비율>100)]

           인구수    남자인구수    여자인구수        남여비율
인천광역시  2947217  1476813  1470404  100.435867

In [148]:
korea_df.loc[(korea_df.인구수>2500000)&(korea_df.남여비율<100)]

           인구수    남자인구수    여자인구수       남여비율
서울특별시  9720846  4732275  4988571  94.862336
부산광역시  3804423  1668618  1735805  96.129346

In [149]:
korea_df.iloc[:3,:2]

           인구수    남자인구수
서울특별시  9720846  4732275
부산광역시  3804423  1668618
인천광역시  2947217  1476813

## 다중 인덱싱(Multi indexing)
### 다중 인덱스 Series

In [151]:
idx_tuples = [('서울특별시',2010),('서울특별시',2020),
            ('부산광역시',2010),('부산광역시',2020),
            ('인천광역시',2010),('인천광역시',2020),
            ('대구광역시',2010),('대구광역시',2020),
            ('대전광역시',2010),('대전광역시',2020),
            ('광주광역시',2010),('광주광역시',2020)]
idx_tuples # multiindex인척

[('서울특별시', 2010),
 ('서울특별시', 2020),
 ('부산광역시', 2010),
 ('부산광역시', 2020),
 ('인천광역시', 2010),
 ('인천광역시', 2020),
 ('대구광역시', 2010),
 ('대구광역시', 2020),
 ('대전광역시', 2010),
 ('대전광역시', 2020),
 ('광주광역시', 2010),
 ('광주광역시', 2020)]

In [154]:
pop_tuples=[10322545,9720846,
           3567910, 3404423,
           2758296, 2947217,
           2511676, 2427954,
           1503664, 1471040,
           1454636, 1455048]
population=pd.Series(pop_tuples,index=idx_tuples)
population

(서울특별시, 2010)    10322545
(서울특별시, 2020)     9720846
(부산광역시, 2010)     3567910
(부산광역시, 2020)     3404423
(인천광역시, 2010)     2758296
(인천광역시, 2020)     2947217
(대구광역시, 2010)     2511676
(대구광역시, 2020)     2427954
(대전광역시, 2010)     1503664
(대전광역시, 2020)     1471040
(광주광역시, 2010)     1454636
(광주광역시, 2020)     1455048
dtype: int64

In [159]:
midx=pd.MultiIndex.from_tuples(idx_tuples)
midx #multiindex

MultiIndex([('서울특별시', 2010),
            ('서울특별시', 2020),
            ('부산광역시', 2010),
            ('부산광역시', 2020),
            ('인천광역시', 2010),
            ('인천광역시', 2020),
            ('대구광역시', 2010),
            ('대구광역시', 2020),
            ('대전광역시', 2010),
            ('대전광역시', 2020),
            ('광주광역시', 2010),
            ('광주광역시', 2020)],
           )

In [168]:
#Multi index Series
population=population.reindex(midx)
population

서울특별시  2010    10322545
       2020     9720846
부산광역시  2010     3567910
       2020     3404423
인천광역시  2010     2758296
       2020     2947217
대구광역시  2010     2511676
       2020     2427954
대전광역시  2010     1503664
       2020     1471040
광주광역시  2010     1454636
       2020     1455048
dtype: int64

In [162]:
population[:,2010]

서울특별시    10322545
부산광역시     3567910
인천광역시     2758296
대구광역시     2511676
대전광역시     1503664
광주광역시     1454636
dtype: int64

In [166]:
 population['대전광역시']
 population['대전광역시',:]

2010    1503664
2020    1471040
dtype: int64

In [173]:
#multiindex로 만들어 놓은 Series를 DataFrame으로 바꾸는 함수
korea_mdf=population.unstack()
korea_mdf

           2010     2020
광주광역시   1454636  1455048
대구광역시   2511676  2427954
대전광역시   1503664  1471040
부산광역시   3567910  3404423
서울특별시  10322545  9720846
인천광역시   2758296  2947217

In [175]:
#DataFrame을 MultiIndex Series로 빠꿔 놓는 함수를 stack()
korea_mdf.stack()

광주광역시  2010     1454636
       2020     1455048
대구광역시  2010     2511676
       2020     2427954
대전광역시  2010     1503664
       2020     1471040
부산광역시  2010     3567910
       2020     3404423
서울특별시  2010    10322545
       2020     9720846
인천광역시  2010     2758296
       2020     2947217
dtype: int64

In [182]:
male_tuples=[5111259,4732275,
           1773170,16668618,
           1390356,1476813,
           1255245,1198815,
           7533648,734441,
           721780,720060]
male_tuples

[5111259,
 4732275,
 1773170,
 16668618,
 1390356,
 1476813,
 1255245,
 1198815,
 7533648,
 734441,
 721780,
 720060]

In [184]:
koreamdf=pd.DataFrame({'총인구수':population,
                     '남자인구수':male_tuples})
koreamdf

                총인구수     남자인구수
서울특별시 2010  10322545   5111259
      2020   9720846   4732275
부산광역시 2010   3567910   1773170
      2020   3404423  16668618
인천광역시 2010   2758296   1390356
      2020   2947217   1476813
대구광역시 2010   2511676   1255245
      2020   2427954   1198815
대전광역시 2010   1503664   7533648
      2020   1471040    734441
광주광역시 2010   1454636    721780
      2020   1455048    720060

In [186]:
female_tuples = [5201286,7988571,
                1794740,1735805,
                1367940,1470404,
                1256431,1229139,
                750016,736599,
                732856,734988]
female_tuples

[5201286,
 7988571,
 1794740,
 1735805,
 1367940,
 1470404,
 1256431,
 1229139,
 750016,
 736599,
 732856,
 734988]

In [188]:
koreamdf=pd.DataFrame({'총인구수':population,
                     '남자인구수':male_tuples,
                      '여자인구수':female_tuples})
koreamdf

                총인구수     남자인구수    여자인구수
서울특별시 2010  10322545   5111259  5201286
      2020   9720846   4732275  7988571
부산광역시 2010   3567910   1773170  1794740
      2020   3404423  16668618  1735805
인천광역시 2010   2758296   1390356  1367940
      2020   2947217   1476813  1470404
대구광역시 2010   2511676   1255245  1256431
      2020   2427954   1198815  1229139
대전광역시 2010   1503664   7533648   750016
      2020   1471040    734441   736599
광주광역시 2010   1454636    721780   732856
      2020   1455048    720060   734988

In [192]:
ratio=koreamdf.남자인구수 *100 / koreamdf.여자인구수
koreamdf=pd.DataFrame({'총인구수':population,
                     '남자인구수':male_tuples,
                      '여자인구수':female_tuples,
                      "남녀비율":ratio})
koreamdf

                총인구수     남자인구수    여자인구수         남녀비율
서울특별시 2010  10322545   5111259  5201286    98.269140
      2020   9720846   4732275  7988571    59.238066
부산광역시 2010   3567910   1773170  1794740    98.798155
      2020   3404423  16668618  1735805   960.281714
인천광역시 2010   2758296   1390356  1367940   101.638668
      2020   2947217   1476813  1470404   100.435867
대구광역시 2010   2511676   1255245  1256431    99.905606
      2020   2427954   1198815  1229139    97.532907
대전광역시 2010   1503664   7533648   750016  1004.464971
      2020   1471040    734441   736599    99.707032
광주광역시 2010   1454636    721780   732856    98.488653
      2020   1455048    720060   734988    97.968946

In [194]:
koreamdf.unstack()

           총인구수             남자인구수              여자인구수                  남녀비율  \
           2010     2020     2010      2020     2010     2020         2010
광주광역시   1454636  1455048   721780    720060   732856   734988    98.488653
대구광역시   2511676  2427954  1255245   1198815  1256431  1229139    99.905606
대전광역시   1503664  1471040  7533648    734441   750016   736599  1004.464971
부산광역시   3567910  3404423  1773170  16668618  1794740  1735805    98.798155
서울특별시  10322545  9720846  5111259   4732275  5201286  7988571    98.269140
인천광역시   2758296  2947217  1390356   1476813  1367940  1470404   101.638668


             2020
광주광역시   97.968946
대구광역시   97.532907
대전광역시   99.707032
부산광역시  960.281714
서울특별시   59.238066
인천광역시  100.435867

### 다중 인덱스 생성

In [198]:
df= pd.DataFrame(np.random.rand(6,3),
                 index=[['a','a','b','b','c','c'],[1,2,1,2,1,2]],
                 columns=['c1','c2','c3'])
df

           c1        c2        c3
a 1  0.983625  0.636918  0.561288
  2  0.796314  0.589304  0.098692
b 1  0.669046  0.887580  0.070050
  2  0.062521  0.157050  0.353485
c 1  0.830340  0.110598  0.557569
  2  0.126903  0.103747  0.118485

In [200]:
 pd.MultiIndex.from_arrays([['a','a','b','b','c','c'],[1,2,1,2,1,2]])

MultiIndex([('a', 1),
            ('a', 2),
            ('b', 1),
            ('b', 2),
            ('c', 1),
            ('c', 2)],
           )

In [202]:
pd.MultiIndex.from_tuples([('a', 1),
            ('a', 2),
            ('b', 1),
            ('b', 2),
            ('c', 1),
            ('c', 2)])

MultiIndex([('a', 1),
            ('a', 2),
            ('b', 1),
            ('b', 2),
            ('c', 1),
            ('c', 2)],
           )

In [204]:
pd.MultiIndex.from_product([['a','b','c'],[1,2]])

MultiIndex([('a', 1),
            ('a', 2),
            ('b', 1),
            ('b', 2),
            ('c', 1),
            ('c', 2)],
           )

In [205]:
pd.MultiIndex(levels=[['a','b','c'],[1,2]],
             codes=[[0,0,1,1,2,2],[0,1,0,1,0,1]])

MultiIndex([('a', 1),
            ('a', 2),
            ('b', 1),
            ('b', 2),
            ('c', 1),
            ('c', 2)],
           )

In [206]:
population

서울특별시  2010    10322545
       2020     9720846
부산광역시  2010     3567910
       2020     3404423
인천광역시  2010     2758296
       2020     2947217
대구광역시  2010     2511676
       2020     2427954
대전광역시  2010     1503664
       2020     1471040
광주광역시  2010     1454636
       2020     1455048
dtype: int64

In [208]:
population.index.names=["행정구역",'연도']
population

행정구역   연도
서울특별시  2010    10322545
       2020     9720846
부산광역시  2010     3567910
       2020     3404423
인천광역시  2010     2758296
       2020     2947217
대구광역시  2010     2511676
       2020     2427954
대전광역시  2010     1503664
       2020     1471040
광주광역시  2010     1454636
       2020     1455048
dtype: int64

In [214]:
idx = pd.MultiIndex.from_product([['a','b','c'],[1,2]],
                                 names=['name1','name2'])
cols=pd.MultiIndex.from_product([[]])